{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"a6814124-c7cc-5361-b796-4c2e62ba6ece","frontmatter":{"title":"ASSET","template":"project","description":"An Adaptive Sensor Actuator System for Elephant Tracking for elephant detection and early warnings. The system will exploit the recent advances in flying robotic (quadcopter) and wireless sensor network (WSN) technology, which enables monitoring of the environment at low cost.","image":"./logos/projects/asset.png","slug":"/projects/asset"}}},{"node":{"id":"bb2bd471-3d06-53e7-9265-7745ef9bb1a5","frontmatter":{"title":"Animal Rescue","template":"project","description":"AnimalRescue App initiative to develop a mobile app to track animals that are in need of help. AnimalRescue app connect animal lovers, vets, and other NGOs in real time. They can track the animals that actually need the help.","image":"./logos/projects/animalrescue.png","slug":"/projects/animalrescue"}}},{"node":{"id":"507988b1-83bd-52e5-ab67-d588aede14b1","frontmatter":{"title":"Bassa","template":"project","description":"Bassa is automated Download Queue for Enterprise to take the best use of Internet bandwidth. It solves the problem of wasting internet bandwidth by queuing a download if it is larger than a given threshold value in high traffic and when the traffic is low, it completes the download of the files.","image":"./logos/projects/bassa.png","slug":"/projects/bassa"}}},{"node":{"id":"ee179175-c4e0-5054-8324-ed2157fe3ebb","frontmatter":{"title":"Bug Zero","template":"project","description":"Bug Zero is the only and the biggest bug bounty platform in Sri Lanka. Bug Zero came into play as a result of a collaboration between ScoreLab and BLUES (UC Berkeley - USA). Bug Zero provides an array of services and products centred around improving the security and privacy posture of organizations. Everything Bug Zero provides is based on empirical research conducted by ScoreLab and collaborative institutions.","image":"./logos/projects/bugzero.png","slug":"/projects/bugzero"}}},{"node":{"id":"ef2296c0-1faf-53f9-94f4-9103fe08e435","frontmatter":{"title":"D4D","template":"project","description":"Drone for(4) Dengue is a system for detecting mosquito breeding sites via drone images. The system provides a low cost drone management system for the different types of users.","image":"./logos/projects/d4d.png","slug":"/projects/d4d"}}},{"node":{"id":"8725a764-a2af-5dc4-8bcc-2cf26203bf95","frontmatter":{"title":"Dronesym","template":"project","description":"Dronesym is a platform enabling users to handle and track their drone fleets in real time. Users can have functionality to add new drones configure their flight paths and monitor their progress through a web dashboard.","image":"./logos/projects/dronesym.png","slug":"/projects/dronesym"}}},{"node":{"id":"862639a5-e24e-5632-9324-a307a0f0c704","frontmatter":{"title":"Elly","template":"project","description":"Elly mobile app is developed to spot elephants in wildlife parks with their locations and other information. Users can upload their own images of elephants, spotted by them with the necessary details and also they can check observations uploaded by other users.","image":"./logos/projects/elly.png","slug":"/projects/elly"}}},{"node":{"id":"369b9534-e417-5aae-8351-37f2615d6ddb","frontmatter":{"title":"Fact Bounty","template":"project","description":"Fact Bounty is a crowd sourced based fact checking platform. Using Fact Bounty, you will be able to find out the truth and minimize the spread of false news and rumors. This app builds to leverage the power of intelligent crowds to improve the social media ecosystem’s efficiency as well as ensure its security and privacy.","image":"./logos/projects/factbounty.png","slug":"/projects/factbounty"}}},{"node":{"id":"58e37a8d-da2b-546a-be9d-adab3e78d422","frontmatter":{"title":"Label Lab","template":"project","description":"LabelLab is an image analyzing and classification platform which allow users to upload batches of images and classify them with labels. It will also have the features to run classifications against a trained model. LabelLab also has a user project management component as well as an image analyzing component.","image":"./logos/projects/labellab.png","slug":"/projects/labellab"}}},{"node":{"id":"6bdd2e5e-7025-54ed-a571-080db3552045","frontmatter":{"title":"OpenMF","template":"project","description":"OpenMF is an open source forensic tool for Android smart phones that helps digital forensic investigators throughout the life cycle of digital forensic investigation.","image":"./logos/projects/openmf.png","slug":"/projects/openmf"}}},{"node":{"id":"1043a186-9efb-5e49-8eef-3650e56c1a42","frontmatter":{"title":"Parks","template":"project","description":"Park mobile app is developed as a guide app to Sri Lankan national parks. Users can find details about each national park and they can upload images spotted at the parks.","image":"./logos/projects/parks.png","slug":"/projects/parks"}}},{"node":{"id":"7326c900-9c6d-54eb-ae26-0d30dd790311","frontmatter":{"title":"Senz","template":"project","description":"SenZ is a new kind of query language that can be used to communicate with IoT devices. It is easily integrable, incredibly fast, and is in the highest end of security integration. Also, it is developed live.","image":"./logos/projects/senz.png","slug":"/projects/senz"}}},{"node":{"id":"01dd0f50-d709-5ad9-b08c-2b2c00c2b5d6","frontmatter":{"title":"Sequza","template":"project","description":"Sequza a platform to aid vulnerability remediation. We developed the Sequza platform to conduct vulnerability remediation in large-scale software projects. Sequza came into play as a result of a collaboration between ScoreLab and BLUES (UC Berkeley - USA). Everything Sequza provides is based on empirical research conducted by ScoreLab and collaborative institutions.","image":"./logos/projects/sequza.png","slug":"/projects/sequza"}}},{"node":{"id":"84f446a7-4dd6-54dc-abf4-cf2082362d03","frontmatter":{"title":"Stackle","template":"project","description":"Stackle is a web communication portal aimed at providing Open Source organizations a platform to have discussions on their GitHub projects and their issues. It provides GitHub integration, which allows the administrator of an organization to create a forum thread.","image":"./logos/projects/stackle.png","slug":"/projects/stackle"}}},{"node":{"id":"300c025e-d661-5d73-bd13-a60584104014","frontmatter":{"title":"TrackPal","template":"project","description":"TrackPal is a public based mobile application that implemented using react-native and Go-social components. By using this mobile application, users can share their locations when they are on a bus or train and that shared location will be updated when it moves and other users can see the shared details.","image":"./logos/projects/trackPal.png","slug":"/projects/trackPal"}}}]}}}